"SPC Password" = "סיסמת SPC";
"Authentication Key" = "קוד אימות";
"Incorrect key" = "מקש שגוי";
"Incorrect SPC Password" = "סיסמת SPC שגויה";
"Enter 26 digit key" = "הקש/י קוד אימות בן 26 ספרות.";
"Security" = "אבטחה";
"Too many retries of SPC." = "הקשת את ה-SPC פעמים רבות מדי.";
"AKEY set successfully." = "ה-AKEY נקבע בהצלחה.";
"Failed to set AKEY." = "לא ניתן היה לקבוע AKEY.";
"Too many retries of AKEY." = "הקשת את ה-AKEY פעמים רבות מדי.";
"Password" = "סיסמה";
"Key" = "קוד";
"OK" = "אישור";
"Cancel" = "ביטול";